STATS = '''
📊 Статистика:

· Всего - <code>%s</code>
· Живы - <code>%s</code>
· Мертвы - <code>%s</code>
· Подписались на ОП - <code>%s</code>

👤 Статистика по времени:

· За сегодня - <code>%s</code>
· За неделю - <code>%s</code>
· За месяц - <code>%s</code>
'''

REF = '''
Название ссылки: <code>{0}</code>

📊 Статистика:
· Всего перешли - <code>{1}</code>
· Из них живы - <code>{2}</code>
· Подписались на ОП - <code>{3}</code>

👤 Статистика по времени:
· Сегодня - <code>{4}</code>
· За последние 7 дней - <code>{5}</code>
· За последние 31 день - <code>{6}</code>

Ссылка: <code>https://t.me/{7}?start={0}</code>
'''

REF_LIST = '''Список реф. ссылок.'''

REF_DEL = '''Вы уверены, что хотите удалить реф. ссылку <code>%s</code>?'''

PRE_CHANNEL_ADD = '''Что добавляем?'''

CHANNEL_ADD = '''
Введите данные в формате:
<code>
  Токен бота | ID канала*
  Название кнопки
  Ссылка на бота | канал
  Отслеживать подписки (1 - да, 0 - нет)
  Лимит переходов (0 - без лимита)
</code>
*ID можно получить через @username_to_id_bot
'''

SPONSOR_DEL = '''Вы уверены, что хотите удалить спонсора <code>%s</code>?'''

SPONSORS = '''
Список спонсоров

🟢 - активен
⭕ - отключен

🤖 - бот
💬 - канал
'''

ADS_ADD = '''
Введите данные в формате:
<code>
  Название поста
  Кол-во просмотров (0 - без лимита)
</code>
'''
